raports/3_raport_html/statistics.json
{
  "2A. GET Formularz Kontrahenta" : {
    "transaction" : "2A. GET Formularz Kontrahenta",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 327.0,
    "medianResTime" : 349.0,
    "minResTime" : 256.0,
    "maxResTime" : 354.0,
    "pct1ResTime" : 354.0,
    "pct2ResTime" : 354.0,
    "pct3ResTime" : 354.0,
    "throughput" : 0.4280821917808219,
    "receivedKBytesPerSec" : 155.08983037243152,
    "sentKBytesPerSec" : 0.1191439693921233
  },
  "2B. POST Dodaj Kontrahenta" : {
    "transaction" : "2B. POST Dodaj Kontrahenta",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 42.4,
    "medianResTime" : 42.0,
    "minResTime" : 37.0,
    "maxResTime" : 50.0,
    "pct1ResTime" : 50.0,
    "pct2ResTime" : 50.0,
    "pct3ResTime" : 50.0,
    "throughput" : 0.4405286343612335,
    "receivedKBytesPerSec" : 0.5631367015418502,
    "sentKBytesPerSec" : 0.3820209251101322
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 20,
    "errorCount" : 5,
    "errorPct" : 25.0,
    "meanResTime" : 224.85,
    "medianResTime" : 277.5,
    "minResTime" : 37.0,
    "maxResTime" : 549.0,
    "pct1ResTime" : 456.8000000000002,
    "pct2ResTime" : 544.9,
    "pct3ResTime" : 549.0,
    "throughput" : 1.5685044310250176,
    "receivedKBytesPerSec" : 208.5344256087758,
    "sentKBytesPerSec" : 0.8064624833346404
  },
  "1A. GET Logowanie" : {
    "transaction" : "1A. GET Logowanie",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 171.4,
    "medianResTime" : 76.0,
    "minResTime" : 70.0,
    "maxResTime" : 549.0,
    "pct1ResTime" : 549.0,
    "pct2ResTime" : 549.0,
    "pct3ResTime" : 549.0,
    "throughput" : 0.4172229639519359,
    "receivedKBytesPerSec" : 3.867624280290387,
    "sentKBytesPerSec" : 0.0721176412299733
  },
  "1B. POST Logowanie" : {
    "transaction" : "1B. POST Logowanie",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 358.6,
    "medianResTime" : 333.0,
    "minResTime" : 299.0,
    "maxResTime" : 467.0,
    "pct1ResTime" : 467.0,
    "pct2ResTime" : 467.0,
    "pct3ResTime" : 467.0,
    "throughput" : 0.42394437849754113,
    "receivedKBytesPerSec" : 67.39291429964388,
    "sentKBytesPerSec" : 0.31299018568763776
  }
}